; ModuleID = '16bd_film_grain_tmpl.c'
source_filename = "16bd_film_grain_tmpl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Dav1dFilmGrainDSPContext = type { void ([82 x i16]*, %struct.Dav1dFilmGrainData*, i32)*, [3 x void ([82 x i16]*, [82 x i16]*, %struct.Dav1dFilmGrainData*, i64, i32)*], void (i16*, i16*, i64, %struct.Dav1dFilmGrainData*, i64, i8*, [82 x i16]*, i32, i32, i32)*, [3 x void (i16*, i16*, i64, %struct.Dav1dFilmGrainData*, i32, i8*, [82 x i16]*, i32, i32, i16*, i64, i32, i32, i32)*] }
%struct.Dav1dFilmGrainData = type { i32, i32, [14 x [2 x i8]], i32, [2 x i32], [2 x [10 x [2 x i8]]], i32, i32, [24 x i8], [2 x [28 x i8]], i64, i32, [2 x i32], [2 x i32], [2 x i32], i32, i32 }

@dav1d_gaussian_sequence = external local_unnamed_addr constant [2048 x i16], align 16
@fgy_32x32xn_c.w = internal unnamed_addr constant [2 x [2 x i32]] [[2 x i32] [i32 27, i32 17], [2 x i32] [i32 17, i32 27]], align 16, !dbg !0
@fguv_32x32xn_c.w = internal unnamed_addr constant [2 x [2 x [2 x i32]]] [[2 x [2 x i32]] [[2 x i32] [i32 27, i32 17], [2 x i32] [i32 17, i32 27]], [2 x [2 x i32]] [[2 x i32] [i32 23, i32 22], [2 x i32] zeroinitializer]], align 16, !dbg !93

; Function Attrs: cold nounwind optsize sspstrong uwtable
define hidden void @dav1d_film_grain_dsp_init_16bpc(%struct.Dav1dFilmGrainDSPContext*) local_unnamed_addr #0 !dbg !305 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "w", scope: !2, file: !3, line: 225, type: !299, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "fgy_32x32xn_c", scope: !3, file: !3, line: 170, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !88, retainedNodes: !220)
!3 = !DIFile(filename: "16bd_film_grain_tmpl.c", directory: "/home/s/git/mozilla-central/obj-x86_64-pc-linux-gnu/media/libdav1d")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !15, !18, !22, !73, !75, !77, !87, !87, !87}
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "pixel", file: !9, line: 61, baseType: !10)
!9 = !DIFile(filename: "third_party/dav1d/include/common/bitdepth.h", directory: "/home/s/git/mozilla-central")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 25, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !13, line: 40, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!14 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !20, line: 35, baseType: !21)
!20 = !DIFile(filename: ".mozbuild/clang/lib/clang/9.0.0/include/stddef.h", directory: "/home/s")
!21 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dav1dFilmGrainData", file: !26, line: 333, baseType: !27)
!26 = !DIFile(filename: "third_party/dav1d/include/dav1d/headers.h", directory: "/home/s/git/mozilla-central")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Dav1dFilmGrainData", file: !26, line: 315, size: 1792, elements: !28)
!28 = !{!29, !31, !33, !41, !42, !45, !49, !50, !51, !59, !63, !67, !68, !69, !70, !71, !72}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !27, file: !26, line: 316, baseType: !30, size: 32)
!30 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "num_y_points", scope: !27, file: !26, line: 317, baseType: !32, size: 32, offset: 32)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y_points", scope: !27, file: !26, line: 318, baseType: !34, size: 224, offset: 64)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 224, elements: !38)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 24, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !13, line: 38, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39, !40}
!39 = !DISubrange(count: 14)
!40 = !DISubrange(count: 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_scaling_from_luma", scope: !27, file: !26, line: 319, baseType: !32, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_points", scope: !27, file: !26, line: 320, baseType: !43, size: 64, offset: 320)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !44)
!44 = !{!40}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "uv_points", scope: !27, file: !26, line: 321, baseType: !46, size: 320, offset: 384)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 320, elements: !47)
!47 = !{!40, !48, !40}
!48 = !DISubrange(count: 10)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_shift", scope: !27, file: !26, line: 322, baseType: !32, size: 32, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeff_lag", scope: !27, file: !26, line: 323, baseType: !32, size: 32, offset: 736)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeffs_y", scope: !27, file: !26, line: 324, baseType: !52, size: 192, offset: 768)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 192, elements: !57)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 24, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !13, line: 37, baseType: !56)
!56 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!58}
!58 = !DISubrange(count: 24)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeffs_uv", scope: !27, file: !26, line: 325, baseType: !60, size: 448, offset: 960)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 448, elements: !61)
!61 = !{!40, !62}
!62 = !DISubrange(count: 28)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ar_coeff_shift", scope: !27, file: !26, line: 326, baseType: !64, size: 64, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 27, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !13, line: 45, baseType: !66)
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "grain_scale_shift", scope: !27, file: !26, line: 327, baseType: !32, size: 32, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "uv_mult", scope: !27, file: !26, line: 328, baseType: !43, size: 64, offset: 1504)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uv_luma_mult", scope: !27, file: !26, line: 329, baseType: !43, size: 64, offset: 1568)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offset", scope: !27, file: !26, line: 330, baseType: !43, size: 64, offset: 1632)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_flag", scope: !27, file: !26, line: 331, baseType: !32, size: 32, offset: 1696)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "clip_to_restricted_range", scope: !27, file: !26, line: 332, baseType: !32, size: 32, offset: 1728)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 46, baseType: !66)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 1312, elements: !85)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry", file: !81, line: 43, baseType: !82)
!81 = !DIFile(filename: "third_party/dav1d/src/film_grain.h", directory: "/home/s/git/mozilla-central")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !54, line: 25, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !13, line: 39, baseType: !84)
!84 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!85 = !{!86}
!86 = !DISubrange(count: 82)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 9.0.0 (https://github.com/llvm/llvm-project.git fe6dbadc0d53efdc34c096dd1695f23467ea6591)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !90, retainedTypes: !91, globals: !92, nameTableKind: None)
!89 = !DIFile(filename: "/home/s/git/mozilla-central/obj-x86_64-pc-linux-gnu/media/libdav1d/16bd_film_grain_tmpl.c", directory: "/home/s/git/mozilla-central/obj-x86_64-pc-linux-gnu/media/libdav1d")
!90 = !{}
!91 = !{!32}
!92 = !{!0, !93}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "w", scope: !95, file: !3, line: 339, type: !218, isLocal: true, isDefinition: true)
!95 = distinct !DISubprogram(name: "fguv_32x32xn_c", scope: !3, file: !3, line: 284, type: !96, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !88, retainedNodes: !98)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !6, !15, !18, !22, !87, !75, !77, !87, !87, !15, !18, !87, !87, !87, !87, !87}
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !124, !126, !129, !131, !134, !138, !140, !141, !142, !144, !148, !151, !152, !153, !154, !155, !156, !157, !158, !161, !162, !164, !167, !168, !169, !170, !171, !172, !173, !174, !175, !178, !179, !181, !185, !188, !189, !190, !191, !192, !193, !194, !195, !196, !199, !200, !202, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !217}
!99 = !DILocalVariable(name: "dst_row", arg: 1, scope: !95, file: !3, line: 284, type: !6)
!100 = !DILocalVariable(name: "src_row", arg: 2, scope: !95, file: !3, line: 284, type: !15)
!101 = !DILocalVariable(name: "stride", arg: 3, scope: !95, file: !3, line: 285, type: !18)
!102 = !DILocalVariable(name: "data", arg: 4, scope: !95, file: !3, line: 285, type: !22)
!103 = !DILocalVariable(name: "pw", arg: 5, scope: !95, file: !3, line: 286, type: !87)
!104 = !DILocalVariable(name: "scaling", arg: 6, scope: !95, file: !3, line: 286, type: !75)
!105 = !DILocalVariable(name: "grain_lut", arg: 7, scope: !95, file: !3, line: 287, type: !77)
!106 = !DILocalVariable(name: "bh", arg: 8, scope: !95, file: !3, line: 287, type: !87)
!107 = !DILocalVariable(name: "row_num", arg: 9, scope: !95, file: !3, line: 288, type: !87)
!108 = !DILocalVariable(name: "luma_row", arg: 10, scope: !95, file: !3, line: 288, type: !15)
!109 = !DILocalVariable(name: "luma_stride", arg: 11, scope: !95, file: !3, line: 289, type: !18)
!110 = !DILocalVariable(name: "uv", arg: 12, scope: !95, file: !3, line: 289, type: !87)
!111 = !DILocalVariable(name: "is_id", arg: 13, scope: !95, file: !3, line: 289, type: !87)
!112 = !DILocalVariable(name: "sx", arg: 14, scope: !95, file: !3, line: 290, type: !87)
!113 = !DILocalVariable(name: "sy", arg: 15, scope: !95, file: !3, line: 290, type: !87)
!114 = !DILocalVariable(name: "bitdepth_max", arg: 16, scope: !95, file: !3, line: 290, type: !87)
!115 = !DILocalVariable(name: "rows", scope: !95, file: !3, line: 292, type: !87)
!116 = !DILocalVariable(name: "bitdepth_min_8", scope: !95, file: !3, line: 293, type: !87)
!117 = !DILocalVariable(name: "grain_ctr", scope: !95, file: !3, line: 294, type: !87)
!118 = !DILocalVariable(name: "grain_min", scope: !95, file: !3, line: 295, type: !87)
!119 = !DILocalVariable(name: "grain_max", scope: !95, file: !3, line: 295, type: !87)
!120 = !DILocalVariable(name: "min_value", scope: !95, file: !3, line: 297, type: !32)
!121 = !DILocalVariable(name: "max_value", scope: !95, file: !3, line: 297, type: !32)
!122 = !DILocalVariable(name: "seed", scope: !95, file: !3, line: 311, type: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !44)
!124 = !DILocalVariable(name: "i", scope: !125, file: !3, line: 312, type: !32)
!125 = distinct !DILexicalBlock(scope: !95, file: !3, line: 312, column: 5)
!126 = !DILocalVariable(name: "offsets", scope: !95, file: !3, line: 320, type: !127)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !128)
!128 = !{!40, !40}
!129 = !DILocalVariable(name: "bx", scope: !130, file: !3, line: 323, type: !32)
!130 = distinct !DILexicalBlock(scope: !95, file: !3, line: 323, column: 5)
!131 = !DILocalVariable(name: "bw", scope: !132, file: !3, line: 324, type: !87)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 323, column: 55)
!133 = distinct !DILexicalBlock(scope: !130, file: !3, line: 323, column: 5)
!134 = !DILocalVariable(name: "i", scope: !135, file: !3, line: 327, type: !32)
!135 = distinct !DILexicalBlock(scope: !136, file: !3, line: 327, column: 13)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 325, column: 39)
!137 = distinct !DILexicalBlock(scope: !132, file: !3, line: 325, column: 13)
!138 = !DILocalVariable(name: "i", scope: !139, file: !3, line: 332, type: !32)
!139 = distinct !DILexicalBlock(scope: !132, file: !3, line: 332, column: 9)
!140 = !DILocalVariable(name: "ystart", scope: !132, file: !3, line: 336, type: !87)
!141 = !DILocalVariable(name: "xstart", scope: !132, file: !3, line: 337, type: !87)
!142 = !DILocalVariable(name: "y", scope: !143, file: !3, line: 363, type: !32)
!143 = distinct !DILexicalBlock(scope: !132, file: !3, line: 363, column: 9)
!144 = !DILocalVariable(name: "x", scope: !145, file: !3, line: 365, type: !32)
!145 = distinct !DILexicalBlock(scope: !146, file: !3, line: 365, column: 13)
!146 = distinct !DILexicalBlock(scope: !147, file: !3, line: 363, column: 43)
!147 = distinct !DILexicalBlock(scope: !143, file: !3, line: 363, column: 9)
!148 = !DILocalVariable(name: "grain", scope: !149, file: !3, line: 366, type: !32)
!149 = distinct !DILexicalBlock(scope: !150, file: !3, line: 365, column: 47)
!150 = distinct !DILexicalBlock(scope: !145, file: !3, line: 365, column: 13)
!151 = !DILocalVariable(name: "lx", scope: !149, file: !3, line: 367, type: !87)
!152 = !DILocalVariable(name: "ly", scope: !149, file: !3, line: 367, type: !87)
!153 = !DILocalVariable(name: "luma", scope: !149, file: !3, line: 367, type: !15)
!154 = !DILocalVariable(name: "avg", scope: !149, file: !3, line: 367, type: !8)
!155 = !DILocalVariable(name: "src", scope: !149, file: !3, line: 367, type: !15)
!156 = !DILocalVariable(name: "dst", scope: !149, file: !3, line: 367, type: !6)
!157 = !DILocalVariable(name: "val", scope: !149, file: !3, line: 367, type: !32)
!158 = !DILocalVariable(name: "combined", scope: !159, file: !3, line: 367, type: !87)
!159 = distinct !DILexicalBlock(scope: !160, file: !3, line: 367, column: 17)
!160 = distinct !DILexicalBlock(scope: !149, file: !3, line: 367, column: 17)
!161 = !DILocalVariable(name: "noise", scope: !149, file: !3, line: 367, type: !87)
!162 = !DILocalVariable(name: "x", scope: !163, file: !3, line: 371, type: !32)
!163 = distinct !DILexicalBlock(scope: !146, file: !3, line: 371, column: 13)
!164 = !DILocalVariable(name: "grain", scope: !165, file: !3, line: 372, type: !32)
!165 = distinct !DILexicalBlock(scope: !166, file: !3, line: 371, column: 46)
!166 = distinct !DILexicalBlock(scope: !163, file: !3, line: 371, column: 13)
!167 = !DILocalVariable(name: "old", scope: !165, file: !3, line: 373, type: !32)
!168 = !DILocalVariable(name: "lx", scope: !165, file: !3, line: 376, type: !87)
!169 = !DILocalVariable(name: "ly", scope: !165, file: !3, line: 376, type: !87)
!170 = !DILocalVariable(name: "luma", scope: !165, file: !3, line: 376, type: !15)
!171 = !DILocalVariable(name: "avg", scope: !165, file: !3, line: 376, type: !8)
!172 = !DILocalVariable(name: "src", scope: !165, file: !3, line: 376, type: !15)
!173 = !DILocalVariable(name: "dst", scope: !165, file: !3, line: 376, type: !6)
!174 = !DILocalVariable(name: "val", scope: !165, file: !3, line: 376, type: !32)
!175 = !DILocalVariable(name: "combined", scope: !176, file: !3, line: 376, type: !87)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 376, column: 17)
!177 = distinct !DILexicalBlock(scope: !165, file: !3, line: 376, column: 17)
!178 = !DILocalVariable(name: "noise", scope: !165, file: !3, line: 376, type: !87)
!179 = !DILocalVariable(name: "y", scope: !180, file: !3, line: 380, type: !32)
!180 = distinct !DILexicalBlock(scope: !132, file: !3, line: 380, column: 9)
!181 = !DILocalVariable(name: "x", scope: !182, file: !3, line: 382, type: !32)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 382, column: 13)
!183 = distinct !DILexicalBlock(scope: !184, file: !3, line: 380, column: 42)
!184 = distinct !DILexicalBlock(scope: !180, file: !3, line: 380, column: 9)
!185 = !DILocalVariable(name: "grain", scope: !186, file: !3, line: 383, type: !32)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 382, column: 47)
!187 = distinct !DILexicalBlock(scope: !182, file: !3, line: 382, column: 13)
!188 = !DILocalVariable(name: "old", scope: !186, file: !3, line: 384, type: !32)
!189 = !DILocalVariable(name: "lx", scope: !186, file: !3, line: 387, type: !87)
!190 = !DILocalVariable(name: "ly", scope: !186, file: !3, line: 387, type: !87)
!191 = !DILocalVariable(name: "luma", scope: !186, file: !3, line: 387, type: !15)
!192 = !DILocalVariable(name: "avg", scope: !186, file: !3, line: 387, type: !8)
!193 = !DILocalVariable(name: "src", scope: !186, file: !3, line: 387, type: !15)
!194 = !DILocalVariable(name: "dst", scope: !186, file: !3, line: 387, type: !6)
!195 = !DILocalVariable(name: "val", scope: !186, file: !3, line: 387, type: !32)
!196 = !DILocalVariable(name: "combined", scope: !197, file: !3, line: 387, type: !87)
!197 = distinct !DILexicalBlock(scope: !198, file: !3, line: 387, column: 17)
!198 = distinct !DILexicalBlock(scope: !186, file: !3, line: 387, column: 17)
!199 = !DILocalVariable(name: "noise", scope: !186, file: !3, line: 387, type: !87)
!200 = !DILocalVariable(name: "x", scope: !201, file: !3, line: 391, type: !32)
!201 = distinct !DILexicalBlock(scope: !183, file: !3, line: 391, column: 13)
!202 = !DILocalVariable(name: "top", scope: !203, file: !3, line: 393, type: !32)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 391, column: 46)
!204 = distinct !DILexicalBlock(scope: !201, file: !3, line: 391, column: 13)
!205 = !DILocalVariable(name: "old", scope: !203, file: !3, line: 394, type: !32)
!206 = !DILocalVariable(name: "grain", scope: !203, file: !3, line: 399, type: !32)
!207 = !DILocalVariable(name: "lx", scope: !203, file: !3, line: 407, type: !87)
!208 = !DILocalVariable(name: "ly", scope: !203, file: !3, line: 407, type: !87)
!209 = !DILocalVariable(name: "luma", scope: !203, file: !3, line: 407, type: !15)
!210 = !DILocalVariable(name: "avg", scope: !203, file: !3, line: 407, type: !8)
!211 = !DILocalVariable(name: "src", scope: !203, file: !3, line: 407, type: !15)
!212 = !DILocalVariable(name: "dst", scope: !203, file: !3, line: 407, type: !6)
!213 = !DILocalVariable(name: "val", scope: !203, file: !3, line: 407, type: !32)
!214 = !DILocalVariable(name: "combined", scope: !215, file: !3, line: 407, type: !87)
!215 = distinct !DILexicalBlock(scope: !216, file: !3, line: 407, column: 17)
!216 = distinct !DILexicalBlock(scope: !203, file: !3, line: 407, column: 17)
!217 = !DILocalVariable(name: "noise", scope: !203, file: !3, line: 407, type: !87)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !219)
!219 = !{!40, !40, !40}
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !241, !242, !244, !247, !251, !253, !254, !255, !257, !261, !264, !265, !266, !267, !269, !272, !273, !274, !275, !276, !278, !282, !285, !286, !287, !288, !289, !291, !294, !295, !296, !297, !298}
!221 = !DILocalVariable(name: "dst_row", arg: 1, scope: !2, file: !3, line: 170, type: !6)
!222 = !DILocalVariable(name: "src_row", arg: 2, scope: !2, file: !3, line: 170, type: !15)
!223 = !DILocalVariable(name: "stride", arg: 3, scope: !2, file: !3, line: 171, type: !18)
!224 = !DILocalVariable(name: "data", arg: 4, scope: !2, file: !3, line: 172, type: !22)
!225 = !DILocalVariable(name: "pw", arg: 5, scope: !2, file: !3, line: 172, type: !73)
!226 = !DILocalVariable(name: "scaling", arg: 6, scope: !2, file: !3, line: 173, type: !75)
!227 = !DILocalVariable(name: "grain_lut", arg: 7, scope: !2, file: !3, line: 174, type: !77)
!228 = !DILocalVariable(name: "bh", arg: 8, scope: !2, file: !3, line: 175, type: !87)
!229 = !DILocalVariable(name: "row_num", arg: 9, scope: !2, file: !3, line: 175, type: !87)
!230 = !DILocalVariable(name: "bitdepth_max", arg: 10, scope: !2, file: !3, line: 175, type: !87)
!231 = !DILocalVariable(name: "rows", scope: !2, file: !3, line: 177, type: !87)
!232 = !DILocalVariable(name: "bitdepth_min_8", scope: !2, file: !3, line: 178, type: !87)
!233 = !DILocalVariable(name: "grain_ctr", scope: !2, file: !3, line: 179, type: !87)
!234 = !DILocalVariable(name: "grain_min", scope: !2, file: !3, line: 180, type: !87)
!235 = !DILocalVariable(name: "grain_max", scope: !2, file: !3, line: 180, type: !87)
!236 = !DILocalVariable(name: "min_value", scope: !2, file: !3, line: 182, type: !32)
!237 = !DILocalVariable(name: "max_value", scope: !2, file: !3, line: 182, type: !32)
!238 = !DILocalVariable(name: "seed", scope: !2, file: !3, line: 196, type: !123)
!239 = !DILocalVariable(name: "i", scope: !240, file: !3, line: 197, type: !32)
!240 = distinct !DILexicalBlock(scope: !2, file: !3, line: 197, column: 5)
!241 = !DILocalVariable(name: "offsets", scope: !2, file: !3, line: 205, type: !127)
!242 = !DILocalVariable(name: "bx", scope: !243, file: !3, line: 208, type: !30)
!243 = distinct !DILexicalBlock(scope: !2, file: !3, line: 208, column: 5)
!244 = !DILocalVariable(name: "bw", scope: !245, file: !3, line: 209, type: !87)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 208, column: 54)
!246 = distinct !DILexicalBlock(scope: !243, file: !3, line: 208, column: 5)
!247 = !DILocalVariable(name: "i", scope: !248, file: !3, line: 213, type: !32)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 213, column: 13)
!249 = distinct !DILexicalBlock(scope: !250, file: !3, line: 211, column: 39)
!250 = distinct !DILexicalBlock(scope: !245, file: !3, line: 211, column: 13)
!251 = !DILocalVariable(name: "i", scope: !252, file: !3, line: 218, type: !32)
!252 = distinct !DILexicalBlock(scope: !245, file: !3, line: 218, column: 9)
!253 = !DILocalVariable(name: "ystart", scope: !245, file: !3, line: 222, type: !87)
!254 = !DILocalVariable(name: "xstart", scope: !245, file: !3, line: 223, type: !87)
!255 = !DILocalVariable(name: "y", scope: !256, file: !3, line: 233, type: !32)
!256 = distinct !DILexicalBlock(scope: !245, file: !3, line: 233, column: 9)
!257 = !DILocalVariable(name: "x", scope: !258, file: !3, line: 235, type: !32)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 235, column: 13)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 233, column: 43)
!260 = distinct !DILexicalBlock(scope: !256, file: !3, line: 233, column: 9)
!261 = !DILocalVariable(name: "grain", scope: !262, file: !3, line: 236, type: !32)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 235, column: 47)
!263 = distinct !DILexicalBlock(scope: !258, file: !3, line: 235, column: 13)
!264 = !DILocalVariable(name: "src", scope: !262, file: !3, line: 237, type: !15)
!265 = !DILocalVariable(name: "dst", scope: !262, file: !3, line: 237, type: !6)
!266 = !DILocalVariable(name: "noise", scope: !262, file: !3, line: 237, type: !87)
!267 = !DILocalVariable(name: "x", scope: !268, file: !3, line: 241, type: !32)
!268 = distinct !DILexicalBlock(scope: !259, file: !3, line: 241, column: 13)
!269 = !DILocalVariable(name: "grain", scope: !270, file: !3, line: 242, type: !32)
!270 = distinct !DILexicalBlock(scope: !271, file: !3, line: 241, column: 46)
!271 = distinct !DILexicalBlock(scope: !268, file: !3, line: 241, column: 13)
!272 = !DILocalVariable(name: "old", scope: !270, file: !3, line: 243, type: !32)
!273 = !DILocalVariable(name: "src", scope: !270, file: !3, line: 246, type: !15)
!274 = !DILocalVariable(name: "dst", scope: !270, file: !3, line: 246, type: !6)
!275 = !DILocalVariable(name: "noise", scope: !270, file: !3, line: 246, type: !87)
!276 = !DILocalVariable(name: "y", scope: !277, file: !3, line: 250, type: !32)
!277 = distinct !DILexicalBlock(scope: !245, file: !3, line: 250, column: 9)
!278 = !DILocalVariable(name: "x", scope: !279, file: !3, line: 252, type: !32)
!279 = distinct !DILexicalBlock(scope: !280, file: !3, line: 252, column: 13)
!280 = distinct !DILexicalBlock(scope: !281, file: !3, line: 250, column: 42)
!281 = distinct !DILexicalBlock(scope: !277, file: !3, line: 250, column: 9)
!282 = !DILocalVariable(name: "grain", scope: !283, file: !3, line: 253, type: !32)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 252, column: 47)
!284 = distinct !DILexicalBlock(scope: !279, file: !3, line: 252, column: 13)
!285 = !DILocalVariable(name: "old", scope: !283, file: !3, line: 254, type: !32)
!286 = !DILocalVariable(name: "src", scope: !283, file: !3, line: 257, type: !15)
!287 = !DILocalVariable(name: "dst", scope: !283, file: !3, line: 257, type: !6)
!288 = !DILocalVariable(name: "noise", scope: !283, file: !3, line: 257, type: !87)
!289 = !DILocalVariable(name: "x", scope: !290, file: !3, line: 261, type: !32)
!290 = distinct !DILexicalBlock(scope: !280, file: !3, line: 261, column: 13)
!291 = !DILocalVariable(name: "top", scope: !292, file: !3, line: 263, type: !32)
!292 = distinct !DILexicalBlock(scope: !293, file: !3, line: 261, column: 46)
!293 = distinct !DILexicalBlock(scope: !290, file: !3, line: 261, column: 13)
!294 = !DILocalVariable(name: "old", scope: !292, file: !3, line: 264, type: !32)
!295 = !DILocalVariable(name: "grain", scope: !292, file: !3, line: 269, type: !32)
!296 = !DILocalVariable(name: "src", scope: !292, file: !3, line: 277, type: !15)
!297 = !DILocalVariable(name: "dst", scope: !292, file: !3, line: 277, type: !6)
!298 = !DILocalVariable(name: "noise", scope: !292, file: !3, line: 277, type: !87)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !128)
!300 = !{i32 2, !"Dwarf Version", i32 4}
!301 = !{i32 2, !"Debug Info Version", i32 3}
!302 = !{i32 1, !"wchar_size", i32 4}
!303 = !{i32 7, !"PIC Level", i32 2}
!304 = !{!"clang version 9.0.0 (https://github.com/llvm/llvm-project.git fe6dbadc0d53efdc34c096dd1695f23467ea6591)"}
!305 = distinct !DISubprogram(name: "dav1d_film_grain_dsp_init_16bpc", scope: !3, file: !3, line: 424, type: !306, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !88, retainedNodes: !342)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !308}
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dav1dFilmGrainDSPContext", file: !81, line: 80, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Dav1dFilmGrainDSPContext", file: !81, line: 74, size: 512, elements: !312)
!312 = !{!313, !320, !331, !336}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "generate_grain_y", scope: !311, file: !81, line: 75, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "generate_grain_y_fn", file: !81, line: 49, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !318, !22, !87}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 1312, elements: !85)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "generate_grain_uv", scope: !311, file: !81, line: 76, baseType: !321, size: 192, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 192, elements: !329)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "generate_grain_uv_fn", file: !81, line: 55, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !318, !77, !22, !326, !87}
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !328, line: 87, baseType: !21)
!328 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!329 = !{!330}
!330 = !DISubrange(count: 3)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fgy_32x32xn", scope: !311, file: !81, line: 78, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "fgy_32x32xn_fn", file: !81, line: 63, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !7, !16, !19, !23, !74, !75, !77, !32, !32, !87}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fguv_32x32xn", scope: !311, file: !81, line: 79, baseType: !337, size: 192, offset: 320)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 192, elements: !329)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "fguv_32x32xn_fn", file: !81, line: 72, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !7, !16, !19, !23, !32, !75, !77, !32, !32, !16, !19, !32, !32, !87}
!342 = !{!343}
!343 = !DILocalVariable(name: "c", arg: 1, scope: !305, file: !3, line: 424, type: !308)
!344 = !DILocation(line: 0, scope: !305)
!345 = !DILocation(line: 425, column: 8, scope: !305)
!346 = !DILocation(line: 425, column: 25, scope: !305)
!347 = !DILocation(line: 426, column: 5, scope: !305)
!348 = !DILocation(line: 426, column: 55, scope: !305)
!349 = !DILocation(line: 428, column: 5, scope: !305)
!350 = !DILocation(line: 428, column: 55, scope: !305)
!351 = !DILocation(line: 430, column: 8, scope: !305)
!352 = !DILocation(line: 430, column: 20, scope: !305)
!353 = !DILocation(line: 431, column: 5, scope: !305)
!354 = !DILocation(line: 431, column: 50, scope: !305)
!355 = !DILocation(line: 433, column: 5, scope: !305)
!356 = !DILocation(line: 433, column: 50, scope: !305)
!357 = !DILocation(line: 439, column: 5, scope: !305)
!358 = !DILocation(line: 442, column: 1, scope: !305)
!359 = distinct !DISubprogram(name: "generate_grain_y_c", scope: !3, file: !3, line: 51, type: !316, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !88, retainedNodes: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !372, !376, !379, !380, !381, !383, !387, !392, !393, !395, !399}
!361 = !DILocalVariable(name: "buf", arg: 1, scope: !359, file: !3, line: 51, type: !318)
!362 = !DILocalVariable(name: "data", arg: 2, scope: !359, file: !3, line: 52, type: !22)
!363 = !DILocalVariable(name: "bitdepth_max", arg: 3, scope: !359, file: !3, line: 53, type: !87)
!364 = !DILocalVariable(name: "bitdepth_min_8", scope: !359, file: !3, line: 55, type: !87)
!365 = !DILocalVariable(name: "seed", scope: !359, file: !3, line: 56, type: !30)
!366 = !DILocalVariable(name: "shift", scope: !359, file: !3, line: 57, type: !87)
!367 = !DILocalVariable(name: "grain_ctr", scope: !359, file: !3, line: 58, type: !87)
!368 = !DILocalVariable(name: "grain_min", scope: !359, file: !3, line: 59, type: !87)
!369 = !DILocalVariable(name: "grain_max", scope: !359, file: !3, line: 59, type: !87)
!370 = !DILocalVariable(name: "y", scope: !371, file: !3, line: 61, type: !32)
!371 = distinct !DILexicalBlock(scope: !359, file: !3, line: 61, column: 5)
!372 = !DILocalVariable(name: "x", scope: !373, file: !3, line: 62, type: !32)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 62, column: 9)
!374 = distinct !DILexicalBlock(scope: !375, file: !3, line: 61, column: 44)
!375 = distinct !DILexicalBlock(scope: !371, file: !3, line: 61, column: 5)
!376 = !DILocalVariable(name: "value", scope: !377, file: !3, line: 63, type: !87)
!377 = distinct !DILexicalBlock(scope: !378, file: !3, line: 62, column: 47)
!378 = distinct !DILexicalBlock(scope: !373, file: !3, line: 62, column: 9)
!379 = !DILocalVariable(name: "ar_pad", scope: !359, file: !3, line: 68, type: !87)
!380 = !DILocalVariable(name: "ar_lag", scope: !359, file: !3, line: 69, type: !87)
!381 = !DILocalVariable(name: "y", scope: !382, file: !3, line: 71, type: !32)
!382 = distinct !DILexicalBlock(scope: !359, file: !3, line: 71, column: 5)
!383 = !DILocalVariable(name: "x", scope: !384, file: !3, line: 72, type: !32)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 72, column: 9)
!385 = distinct !DILexicalBlock(scope: !386, file: !3, line: 71, column: 49)
!386 = distinct !DILexicalBlock(scope: !382, file: !3, line: 71, column: 5)
!387 = !DILocalVariable(name: "coeff", scope: !388, file: !3, line: 73, type: !390)
